Revit 2027 API
SizingCalculator Methods
The SizingCalculator type exposes the following members.
Methods
Name | Description
CalculateSizeByFriction |  Calculates the duct or pipe size based on the specified flow and friction.
CalculateSizeByVelocity |  Calculates the duct or pipe size based on the specified flow and velocity.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EquivalentDiameter |  Calculates the equivalent diameter based on the specified profile type, width, and height.
Friction |  Calculates the friction based on the specified parameters.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Velocity |  Calculates the velocity based on the specified parameters.
Top
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace